app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save
---
INSERT INTO "microposts" ("address", "category", "content", "created_at", "latitude", "longitude", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

def votes_for
  @micropost = Micropost.find(params[:id])
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = $1 ORDER BY microposts.created_at DESC LIMIT 1  [["id", "35"]]

def show
  # @microposts = Micropost.all
  respond_to do |format|
    format.html { @microposts = Micropost.paginate(:page => params[:page]) }
---
SELECT COUNT(*) FROM "microposts" WHERE (microposts.latitude BETWEEN 42.38202802168892 AND 42.41097437831109 AND microposts.longitude BETWEEN -71.12334986735648 AND -71.08415353264353 AND 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((42.3965012 - microposts.latitude) * PI() / 180 / 2), 2) + COS(42.3965012 * PI() / 180) * COS(microposts.latitude * PI() / 180) * POWER(SIN((-71.1037517 - microposts.longitude) * PI() / 180 / 2), 2))) <= 1)
SELECT microposts.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((42.3965012 - microposts.latitude) * PI() / 180 / 2), 2) + COS(42.3965012 * PI() / 180) * COS(microposts.latitude * PI() / 180) * POWER(SIN((-71.1037517 - microposts.longitude) * PI() / 180 / 2), 2))) AS distance, CAST(DEGREES(ATAN2( RADIANS(microposts.longitude - -71.1037517), RADIANS(microposts.latitude - 42.3965012))) + 360 AS decimal) % 360 AS bearing FROM "microposts" WHERE (microposts.latitude BETWEEN 42.38202802168892 AND 42.41097437831109 AND microposts.longitude BETWEEN -71.12334986735648 AND -71.08415353264353 AND 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((42.3965012 - microposts.latitude) * PI() / 180 / 2), 2) + COS(42.3965012 * PI() / 180) * COS(microposts.latitude * PI() / 180) * POWER(SIN((-71.1037517 - microposts.longitude) * PI() / 180 / 2), 2))) <= 1) ORDER BY microposts.created_at DESC, distance ASC LIMIT 10 OFFSET 0